ymaps.ready(init);
        function init(){
            myMap = new ymaps.Map("map", {
                center: [55.75740995242725, 37.66106843948364],
                zoom: 11
            });
            var Icon1 = new ymaps.Placemark([55.75740995242725, 37.66106843948364], {
                hintContent: 'Курский вокзал',
                balloonContent: 'пойдешь направо — обязательно попадешь на Курский вокзал'
            }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#232ea4',
                    }),

                Icon2 = new ymaps.Placemark([55.794429945434764, 37.58869171142578], {
                    hintContent: 'Савёловский вокзал',
                    balloonContent: 'я как только вышел на Савеловском, выпил для начала стакан зубровки'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#232ea4',
                    }),

                Icon4 = new ymaps.Placemark([55.77017631795949, 37.605342864990234], {
                    hintContent: 'Улица Чехова',
                    balloonContent: 'на улице Чехова я выпил два стакана охотничьей'
                }, {
                    preset: 'islands#blueBarIcon',
                        iconColor: '#3dbe25',

                    }),

                Icon3 = new ymaps.Placemark([55.775317899805835, 37.60379791259765], {
                    hintContent: 'Каляевская улица',
                    balloonContent: 'А потом — на Каляевской — другой стакан, только уже не зубровки, а кориандровой'
                }, {
                    preset: 'islands#blueBarIcon',
                        iconColor: '#3dbe25',
                    }),

                Icon5 = new ymaps.Placemark([55.748179, 37.682251], {
                    hintContent: 'платформа Серп и Молот',
                    balloonContent: 'Вот только похмелюсь на Серпе и Молоте, и ... и тогда все, все расскажу.'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon6 = new ymaps.Placemark([55.732600, 37.738216], {
                    hintContent: 'платформа Карачарово',
                    balloonContent: 'до Карачарова, мой Бог не мог расслы-шать мою мольбу'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon7 = new ymaps.Placemark([55.733716, 37.764474], {
                    hintContent: 'платформа Чухлинка',
                    balloonContent: 'из Чухлинки в Усад, расстояние девяносто километров, — ты наливаешь Семенычу девяносто грамм и дальше едешь совершенно спокойно'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon8 = new ymaps.Placemark([55.739657, 37.794660], {
                    hintContent: 'станция Кусково',
                    balloonContent: 'Кусково! Мы чешем без остановки через Кусково!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),
                Icon9 = new ymaps.Placemark([55.744257, 37.818031], {
                    hintContent: 'платформа Новогиреево',
                    //balloonContent: 'Кусково! Мы чешем без остановки через Кусково!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon10 = new ymaps.Placemark([55.752359, 37.859543], {
                    hintContent: 'станция Реутово',
                    //balloonContent: 'Кусково! Мы чешем без остановки через Кусково!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon11 = new ymaps.Placemark([55.757642, 37.923278], {
                    hintContent: 'платформа Салтыковская',
                    balloonContent: 'А это ты, черноусый? Салтыковская — Орехово-Зуево? Семьдесят два грамма.'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon12 = new ymaps.Placemark([55.752100, 37.955258], {
                    hintContent: 'платформа Кучино',
                    balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon13 = new ymaps.Placemark([55.752310, 38.008867], {
                    hintContent: 'платформа Железнодорожная',
                    //balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon14 = new ymaps.Placemark([55.753169, 38.059678], {
                    hintContent: 'платформа Чёрное',
                    //balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon15 = new ymaps.Placemark([55.753280, 38.120442], {
                    hintContent: 'станция Купавна',
                    //balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon16 = new ymaps.Placemark([55.744267, 38.153076], {
                    hintContent: 'платформа 33-й километр',
                    //balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon37 = new ymaps.Placemark([55.730096, 38.202501], {
                    hintContent: 'станция Электроугли',
                    //balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon17 = new ymaps.Placemark([55.722198, 38.291138], {
                    hintContent: 'платформа 43-й километр',
                    //balloonContent: 'Через муки на Курском вокзале, через очищение в Кучино'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon18 = new ymaps.Placemark([55.721021, 38.347418], {
                    hintContent: 'станция Храпуново',
                    balloonContent: 'Может, человеку захотелось в Петушки, а ты его гонишь в Храпуново!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon19 = new ymaps.Placemark([55.720276, 38.378526], {
                    hintContent: 'платформа Есино',
                    balloonContent: 'Вот мы сейчас едем в Петушки и почему-то везде остановки, кроме Есино.'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon20 = new ymaps.Placemark([55.732357, 38.465483], {
                    hintContent: 'станция Фрязево',
                    //balloonContent: 'Вот мы сейчас едем в Петушки и почему-то везде остановки, кроме Есино.'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon21 = new ymaps.Placemark([55.756667, 38.573304], {
                    hintContent: 'станция 61-й километр (сейчас Казанское)',
                    //balloonContent: 'Вот мы сейчас едем в Петушки и почему-то везде остановки, кроме Есино.'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon22 = new ymaps.Placemark([55.769412, 38.629953], {
                    hintContent: 'станция 65-й километр (сейчас Вохна)',
                    //balloonContent: 'Вот мы сейчас едем в Петушки и почему-то везде остановки, кроме Есино.'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon23 = new ymaps.Placemark([55.775800, 38.674756], {
                    hintContent: 'станция Павлово-Посад',
                    balloonContent: 'Например, в Павлово-Посаде. Меня подводят к дамам и представляют так'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon24 = new ymaps.Placemark([55.755794, 38.777756], {
                    hintContent: 'платформа Назарьево',
                    //balloonContent: 'Например, в Павлово-Посаде. Меня подводят к дамам и представляют так'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon25 = new ymaps.Placemark([55.748143, 38.853268], {
                    hintContent: 'станция Дрезна',
                    //balloonContent: 'Например, в Павлово-Посаде. Меня подводят к дамам и представляют так'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon26 = new ymaps.Placemark([55.761311, 38.931495], {
                    hintContent: 'станция 85-й километр (сейчас Кабаново)',
                    //balloonContent: 'Например, в Павлово-Посаде. Меня подводят к дамам и представляют так'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon27 = new ymaps.Placemark([55.795503, 38.975364], {
                    hintContent: 'станция Орехово-Зуево',
                    balloonContent: 'Поезд как вкопанный остановился на станции Орехово-Зуево, и дверь автоматически растворилась...'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon28 = new ymaps.Placemark([55.811174, 39.005236], {
                    hintContent: 'платформа Крутое',
                    //balloonContent: 'Поезд как вкопанный остановился на станции Орехово-Зуево, и дверь автоматически растворилась...'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon29 = new ymaps.Placemark([55.843172, 39.064472], {
                    hintContent: 'платформа Воиново',
                    //balloonContent: 'Поезд как вкопанный остановился на станции Орехово-Зуево, и дверь автоматически растворилась...'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon30 = new ymaps.Placemark([55.869107, 39.103422], {
                    hintContent: 'станция Усад',
                    balloonContent: '— Мы подъезжаем к Усаду, да?'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon31 = new ymaps.Placemark([55.880723, 39.162834], {
                    hintContent: 'станция 105-й километр (сейчас Глубоково)',
                    //balloonContent: '— Мы подъезжаем к Усаду, да?'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon32 = new ymaps.Placemark([55.891628, 39.216502], {
                    hintContent: 'станция Покров',
                    balloonContent: 'если станция Покров оказалась справа, значит, я еду из Петушков в Москву, а не из Москвы в Петушки!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e9a235',
                    }),

                Icon33 = new ymaps.Placemark([55.904680, 39.282106], {
                    hintContent: 'платформа 113-й километр',
                    //balloonContent: 'если станция Покров оказалась справа, значит, я еду из Петушков в Москву, а не из Москвы в Петушки!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e90700',
                    }),

                Icon34 = new ymaps.Placemark([55.909544, 39.322144], {
                    hintContent: 'платформа Омутище',
                    //balloonContent: 'если станция Покров оказалась справа, значит, я еду из Петушков в Москву, а не из Москвы в Петушки!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e90700',
                    }),

                Icon35 = new ymaps.Placemark([55.918252, 39.394377], {
                    hintContent: 'платформа Леоново',
                    //balloonContent: 'если станция Покров оказалась справа, значит, я еду из Петушков в Москву, а не из Москвы в Петушки!'
                }, {
                    preset: 'islands#blueRailwayIcon',
                        iconColor: '#e90700',
                    }),

                Icon36 = new ymaps.Placemark([55.924722, 39.462990], {
                    hintContent: 'станция Петушки',
                    balloonContent: 'Может, и в самом деле — Петушки?'
                }, {
                    preset: 'islands#blueHomeIcon',
                        iconColor: '#e319e9',
                    }),

                myPolyline1 = new ymaps.Polyline(
                    [
                        [55.79452644712383, 37.58869171142578],
                        [55.79148652905221, 37.58920669555664],
                        [55.78381329977642, 37.59701728820801],
                        [55.77908313513154, 37.60113716125488],
                        [55.77541444884565, 37.60354042053223],
                        [55.775293762508525, 37.60371208190918],
                        [55.77222820424484, 37.60448455810547],
                        [55.77020045842601, 37.605299949645996],
                        [55.77017631795949, 37.605342864990234]
                    ],
                    {},
                    {
                        strokeWidth: 5,
                        strokeColor: '#ca0829',
                        draggable: false

                    });

                myPolyline2 = new ymaps.Polyline(
                    [
                        [55.75740995242725, 37.66106843948364], //курский вокзал
                        [55.756092, 37.661798],
                        [55.754689, 37.663643],
                        [55.753454, 37.665617],
                        [55.751598, 37.668267],
                        [55.751209, 37.669009],
                        [55.750816, 37.670123],
                        [55.750039, 37.672538],
                        [55.749497, 37.676135],
                        [55.749133, 37.678259],
                        [55.748722, 37.680212],
                        [55.748179, 37.682251], //cерп и молот
                        [55.747839, 37.683215],
                        [55.747258, 37.684588],
                        [55.746229, 37.686605],
                        [55.745600, 37.687678],
                        [55.744498, 37.689394],
                        [55.743845, 37.690103],
                        [55.743070, 37.690725],
                        [55.741484, 37.691690],
                        [55.741484, 37.691690],
                        [55.739778, 37.693278],
                        [55.739003, 37.694480],
                        [55.738531, 37.695338],
                        [55.738107, 37.696454],
                        [55.737744, 37.697699],
                        [55.736884, 37.700660],
                        [55.735867, 37.704651],
                        [55.735528, 37.706475],
                        [55.732600, 37.738216], //карачарово
                        [55.731941, 37.746061],
                        [55.731832, 37.748464],
                        [55.731881, 37.750824],
                        [55.732099, 37.754633],
                        [55.732426, 37.757294],
                        [55.732881, 37.760125],
                        [55.733716, 37.764474], //чухлинка
                        [55.736115, 37.776665],
                        [55.736345, 37.778146],
                        [55.738792, 37.790570],
                        [55.739088, 37.791815],
                        [55.739657, 37.794660], //кусково
                        [55.740325, 37.798105],
                        [55.741330, 37.803412],
                        [55.742634, 37.809816],
                        [55.744257, 37.818031], //новогиреево
                        [55.752359, 37.859543], //реутово
                        [55.759652, 37.896511],
                        [55.760179, 37.899644],
                        [55.760294, 37.900513],
                        [55.760433, 37.902004],
                        [55.760499, 37.903549],
                        [55.760487, 37.904762],
                        [55.760360, 37.906811],
                        [55.760215, 37.908141],
                        [55.759991, 37.909633],
                        [55.757642, 37.923278], //салтыковская
                        [55.752100, 37.955258], //кучино
                        [55.751678, 37.958072],
                        [55.751509, 37.960132],
                        [55.751436, 37.961720],
                        [55.751448, 37.964434],
                        [55.751600, 37.967878],
                        [55.751624, 37.968822],
                        [55.752310, 38.008867], //железнодорожная
                        [55.753169, 38.059678],// черное
                        [55.754028, 38.105912],
                        [55.754058, 38.110305],
                        [55.754016, 38.113127],
                        [55.753810, 38.116420],
                        [55.753532, 38.118781],
                        [55.753280, 38.120442],//купавна,
                        [55.752890, 38.122568],
                        [55.752394, 38.124778],
                        [55.751535, 38.127825],
                        [55.744267, 38.153076],//33-й километр
                        [55.730096, 38.202501],//электроугли
                        [55.727328, 38.211596],
                        [55.725100, 38.219492],
                        [55.724373, 38.222754],
                        [55.723695, 38.227560],
                        [55.723501, 38.230049],
                        [55.722198, 38.291138],//43км
                        [55.721021, 38.347418],//храпуново
                        [55.720276, 38.378526],//есино
                        [55.719909, 38.394701],
                        [55.720006, 38.402254],
                        [55.720442, 38.409121],
                        [55.721024, 38.413841],
                        [55.723906, 38.428647],
                        [55.726255, 38.438947],
                        [55.726740, 38.441007],
                        [55.732357, 38.465483],//фрязево
                        [55.756667, 38.573304],//61
                        [55.769412, 38.629953],//65
                        [55.773740, 38.649145],
                        [55.774393, 38.652492],
                        [55.775315, 38.659760],
                        [55.775629, 38.663880],
                        [55.775871, 38.669245],
                        [55.775800, 38.674756],//павло-посад
                        [55.775726, 38.678471],
                        [55.775726, 38.678471],
                        [55.773960, 38.692934],
                        [55.761302, 38.747662],
                        [55.759947, 38.753327],
                        [55.758883, 38.758477],
                        [55.758060, 38.763798],
                        [55.755794, 38.777756],//назарьево
                        [55.751259, 38.806714],
                        [55.750945, 38.809675],
                        [55.750630, 38.814095],
                        [55.748352, 38.849593],
                        [55.748352, 38.851095],
                        [55.748143, 38.853268],//дрезна
                        [55.747239, 38.866481],
                        [55.746222, 38.881437],
                        [55.746138, 38.883496],
                        [55.746274, 38.886877],
                        [55.746504, 38.888712],
                        [55.746836, 38.890321],
                        [55.747435, 38.892446],
                        [55.761311, 38.931495],//85
                        [55.767024, 38.947495],
                        [55.767024, 38.947495],
                        [55.768102, 38.950083],
                        [55.769008, 38.951615],
                        [55.769637, 38.952559],
                        [55.770991, 38.954018],
                        [55.773507, 38.956271],
                        [55.793616, 38.974011],
                        [55.794922, 38.975159],
                        [55.795454, 38.975706],//орехово-зуево
                        [55.796022, 38.976319],
                        [55.796748, 38.977317],
                        [55.797298, 38.978251],
                        [55.798480, 38.980228],
                        [55.803512, 38.989476],
                        [55.803911, 38.990291],
                        [55.807276, 38.997093],
                        [55.808412, 38.999325],
                        [55.808805, 39.000194],
                        [55.809439, 39.001675],
                        [55.811174, 39.005236],//крутое
                        [55.833704, 39.049828],
                        [55.835757, 39.053133],
                        [55.843172, 39.064472],//воиново
                        [55.855918, 39.083491],
                        [55.857584, 39.086452],
                        [55.865722, 39.098594],
                        [55.866446, 39.099473],
                        [55.869107, 39.103422],//усад
                        [55.870572, 39.105610],
                        [55.872937, 39.109215],
                        [55.874288, 39.111790],
                        [55.875542, 39.114580],
                        [55.877183, 39.119772],
                        [55.877774, 39.122218],
                        [55.878268, 39.125137],
                        [55.878401, 39.126167],
                        [55.878739, 39.128999],
                        [55.878835, 39.130244],
                        [55.880723, 39.162834],//105
                        [55.881766, 39.180240],
                        [55.881766, 39.180240],
                        [55.881939, 39.182349],
                        [55.881951, 39.182499],
                        [55.882554, 39.186619],
                        [55.882876, 39.188222],
                        [55.883539, 39.190883],
                        [55.884661, 39.194488],
                        [55.891628, 39.216502],//покров
                        [55.897935, 39.236509],
                        [55.898707, 39.238987],
                        [55.898954, 39.239851],
                        [55.899283, 39.241068],
                        [55.899536, 39.242098],
                        [55.899989, 39.244278],
                        [55.900284, 39.245995],
                        [55.900375, 39.246623],
                        [55.900565, 39.248082],
                        [55.900948, 39.251336],
                        [55.904680, 39.282106],//113
                        [55.909544, 39.322144],//омутище
                        [55.918252, 39.394377],//леоново
                        [55.923915, 39.441532],
                        [55.924132, 39.443420],
                        [55.924349, 39.445136],
                        [55.924463, 39.446123],
                        [55.924584, 39.447454],
                        [55.924674, 39.449192],
                        [55.924710, 39.450565],
                        [55.924729, 39.451638],
                        [55.924722, 39.462990]//петушки
                    ],
                    {},
                    {
                        strokeWidth: 6,
                        strokeColor: '#ca0829',
                        draggable: false
                    });

            myMap.geoObjects
                .add(Icon1)
                .add(Icon2)
                .add(Icon4)
                .add(Icon3)
                .add(Icon5)
                .add(Icon6)
                .add(Icon7)
                .add(Icon8)
                .add(Icon9)
                .add(Icon10)
                .add(Icon11)
                .add(Icon12)
                .add(Icon13)
                .add(Icon14)
                .add(Icon15)
                .add(Icon16)
                .add(Icon17)
                .add(Icon18)
                .add(Icon19)
                .add(Icon20)
                .add(Icon21)
                .add(Icon22)
                .add(Icon23)
                .add(Icon24)
                .add(Icon25)
                .add(Icon26)
                .add(Icon27)
                .add(Icon28)
                .add(Icon29)
                .add(Icon30)
                .add(Icon31)
                .add(Icon32)
                .add(Icon33)
                .add(Icon34)
                .add(Icon35)
                .add(Icon36)
                .add(Icon37)
                .add(myPolyline2)
                .add(myPolyline1);

        }/**
 * Created by Александра on 23.05.2017.
 */
